[Rainmeter]
Update=1000
AccurateText=1
DynamicWindowSize=1

[Metadata]
Name= Chinese word a day.
Author= Al.
Information= [ this widget created for someone who wanted to learn chinese 1 word a day. you can add more via Words.txt ]
License= FreeToUse
Version= 1.0

[Variables]
FontMain=Microsoft YaHei
FontSecondary=Segoe UI
ColorText=255,255,255
ColorMuted=200,200,200,180
ColorAccent=0,255,127,200
ColorBg=0,0,0,160
CardWidth=340
CardHeight=280


[MeasureRandomLine]
Measure=Plugin
Plugin=QuotePlugin
PathName=#CURRENTPATH#Words.txt
FileEncoding=UTF16
; This is the ONLY freeze command we need. 
; It tells the measure: "Do nothing until I click."
UpdateDivider=-1


[MeasureWord]
Measure=String
String=[MeasureRandomLine]
RegExpSubstitute=1
Substitute="^([^|]+)\|.*$":"\1"
DynamicVariables=1

[MeasurePinyin]
Measure=String
String=[MeasureRandomLine]
RegExpSubstitute=1
Substitute="^[^|]+\|([^|]+)\|.*$":"\1"
DynamicVariables=1

[MeasureEnglish]
Measure=String
String=[MeasureRandomLine]
RegExpSubstitute=1
Substitute="^[^|]+\|[^|]+\|([^|]+)\|.*$":"\1"
DynamicVariables=1

[MeasureSentenceCN]
Measure=String
String=[MeasureRandomLine]
RegExpSubstitute=1
Substitute="^[^|]+\|[^|]+\|[^|]+\|([^|]+)\|.*$":"\1"
DynamicVariables=1

[MeasureSentencePY]
Measure=String
String=[MeasureRandomLine]
RegExpSubstitute=1
Substitute="^[^|]+\|[^|]+\|[^|]+\|[^|]+\|([^|]+)\|.*$":"\1"
DynamicVariables=1

[MeasureSentenceEN]
Measure=String
String=[MeasureRandomLine]
RegExpSubstitute=1
Substitute="^[^|]+\|[^|]+\|[^|]+\|[^|]+\|[^|]+\|(.*)$":"\1"
DynamicVariables=1

; --- UI ---

[MeterBackground]
Meter=Shape
Shape=Rectangle 0,0,#CardWidth#,#CardHeight#,12 | Fill Color #ColorBg# | StrokeWidth 0

[MeterWord]
Meter=String
MeasureName=MeasureWord
FontFace=#FontMain#
FontSize=46
FontColor=#ColorText#
X=(#CardWidth#/2)
Y=25
StringAlign=Center
AntiAlias=1
; CLEANER CLICK: This just forces the randomizer to pick one new word.
LeftMouseUpAction=[!CommandMeasure MeasureRandomLine "Update"][!UpdateMeasure *][!Redraw]
RightMouseUpAction=[!SetClip "[MeasureWord]"]

[MeterPinyin]
Meter=String
MeasureName=MeasurePinyin
FontFace=#FontSecondary#
FontSize=14
FontColor=#ColorMuted#
X=(#CardWidth#/2)
Y=2R
StringAlign=Center
AntiAlias=1

[MeterEnglish]
Meter=String
MeasureName=MeasureEnglish
FontFace=#FontSecondary#
FontSize=18
FontWeight=600
FontColor=#ColorText#
X=(#CardWidth#/2)
Y=15R
StringAlign=Center
AntiAlias=1
Hidden=1

[MeterSentence]
Meter=String
MeasureName=MeasureSentenceCN
MeasureName2=MeasureSentencePY
MeasureName3=MeasureSentenceEN
Text="%1#CRLF#%2#CRLF#%3"
FontFace=#FontSecondary#
FontSize=11
FontColor=#ColorMuted#
InlineSetting=Italic | Index 2
X=(#CardWidth#/2)
Y=12R
W=(#CardWidth#-40)
ClipString=2
StringAlign=Center
AntiAlias=1
Hidden=1

[MouseOverRegion]
Meter=Image
SolidColor=0,0,0,1
W=#CardWidth#
H=#CardHeight#
MouseOverAction=[!ShowMeter MeterEnglish][!ShowMeter MeterSentence][!Redraw]
MouseLeaveAction=[!HideMeter MeterEnglish][!HideMeter MeterSentence][!Redraw]
